Revit 2024 API
ElementClassFilter.GetElementClass Method
 The class for the filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public Type GetElementClass()
Visual Basic
Public Function GetElementClass As Type
Visual C++
public:
Type^ GetElementClass()
Return Value
 The class.
See Also
ElementClassFilter Class
Autodesk.Revit.DB Namespace